Public Attributes | List of all members
API_RoofRelation Struct Reference
Element Manager
Structure for retrieving connection data of a roof or a shell element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 GS::Array< API_Guid > *  | rooms
Array of guid of the rooms connected to the roof or shell.
Detailed Description
Structure for retrieving connection data of a roof or a shell element.
Remarks
To learn more about the usage of this relation structure please refer to the ACAPI_Element_GetRelations function. See also API_ShellRelation.